//арифметическое всех целых чисел от 1 до 1000.
#include <iostream>
using namespace std;

int main()
{
	double n = 0;
	//####################### цикл for #############################################
	/*	for (int i = 1; i <= 1000; ++i) {
		n += i;
		}*/
	//####################### цикл while ###########################################
	/*	int i = 1;
		while (i <= 1000) {
		n += i;
		i++;
		}*/
	//####################### цикл do....while #####################################
	int i = 1;
	do {
		n += i;
		i++;
	} while (i <= 1000);
cout << n/1000 <<"\n";
}